pandas, numpy, matplotlib import하기

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

info 알 수 있는 함수

In [2]:
def seriesInfo(s):
    print('value: ', s.values)
    print('value type: ', type(s.values))
    print('index: ', s.index)
    print('index type: ', type(s.index))
    print('index + value:\n', s)

더미데이터

In [3]:
price_series = pd.Series([4000, 3000, 3500, 2000],
                        index = ['a', 'b', 'c', 'd'])
seriesInfo(price_series)

value:  [4000 3000 3500 2000]
value type:  <class 'numpy.ndarray'>
index:  Index(['a', 'b', 'c', 'd'], dtype='object')
index type:  <class 'pandas.core.indexes.base.Index'>
index + value:
 a    4000
b    3000
c    3500
d    2000
dtype: int64

라벨 인덱싱

In [4]:
price_series['a']

4000

배열 인덱싱

In [5]:
price_series[0]

4000

추가

In [7]:
price_series['e'] = 2000
price_series

a    4000
b    3000
c    3500
d    2000
e    2000
dtype: int64

삭제

In [8]:
del price_series['e']
price_series

a    4000
b    3000
c    3500
d    2000
dtype: int64

set 으로 Series 만들기

In [12]:
set = pd.Series(list({1, 2, 3, 4, 5}))
seriesInfo(set)

value:  [1 2 3 4 5]
value type:  <class 'numpy.ndarray'>
index:  RangeIndex(start=0, stop=5, step=1)
index type:  <class 'pandas.core.indexes.range.RangeIndex'>
index + value:
 0    1
1    2
2    3
3    4
4    5
dtype: int64

> [{1, 2, 3, 4, 5}]  
이 자체로 list에 담는 것이 아니라

> list={1, 2, 3, 4, 5}  
이렇게 list형식 casting해야 한다.

Series 연산

In [13]:
pd.isnull(set)

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [14]:
pd.notnull(set)

0    True
1    True
2    True
3    True
4    True
dtype: bool

null 값 넣기

In [19]:
set[0] = np.NaN
set

0    NaN
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

NaN이 들어가면 dtype은 float64으로 변한다.

Series끼리 연산

In [21]:
ser01 = pd.Series([10, 20, 30, 40],
                 index = ['a', 'b', 'c', 'd'])

ser02 = pd.Series([100, 200, 300, 400],
                 index = ['a', 'd', 'h', 'g'])

In [22]:
ser03 = ser01 + ser02
ser03

a    110.0
b      NaN
c      NaN
d    240.0
g      NaN
h      NaN
dtype: float64

index가 없는 경우 NaN으로 출력된다

In [25]:
ser04 = ser01.add(ser02, fill_value=0)
ser04

a    110.0
b     20.0
c     30.0
d    240.0
g    400.0
h    300.0
dtype: float64

`.add(fill_value=0)`해주면 NaN이 아니라 자기가 그대로 나온다

결측치처리

`.fillna(0)` 0으로 채우기

In [26]:
zser = ser03.fillna(0)
zser

a    110.0
b      0.0
c      0.0
d    240.0
g      0.0
h      0.0
dtype: float64

평균으로 채우기

In [27]:
zser = ser03.fillna(np.mean(ser03))
zser

a    110.0
b    175.0
c    175.0
d    240.0
g    175.0
h    175.0
dtype: float64

결측치 찾기

In [29]:
pd.isnull(ser03)

a    False
b     True
c     True
d    False
g     True
h     True
dtype: bool

In [30]:
pd.notnull(ser03)

a     True
b    False
c    False
d     True
g    False
h    False
dtype: bool

결측값제거 = notnull인 것만 가져오기

In [32]:
ser05 = ser03[pd.notnull(ser03)]
ser05

a    110.0
d    240.0
dtype: float64

# DataFrame

In [35]:
data = {
    '2020': [9087769, 7653225, 6539480, 2787393],
    '2018': [9203944, 4849200, 5595900, 3282459],
    '2016': [8909857, 5674521, 6743189, 3468901],
    '지역': ['수도권', '경상권', '수도권', '경상권'],
    '증가율': [0.2346, 0.4335, 0.9483, 0.1562]
}
pop_df = pd.DataFrame(data)

In [36]:
pop_df

      2020     2018     2016   지역     증가율
0  9087769  9203944  8909857  수도권  0.2346
1  7653225  4849200  5674521  경상권  0.4335
2  6539480  5595900  6743189  수도권  0.9483
3  2787393  3282459  3468901  경상권  0.1562

인덱스 넣기

In [37]:
pop_df = pd.DataFrame(data, index = ['서울', '경기', '부산', '인천'])
pop_df

       2020     2018     2016   지역     증가율
서울  9087769  9203944  8909857  수도권  0.2346
경기  7653225  4849200  5674521  경상권  0.4335
부산  6539480  5595900  6743189  수도권  0.9483
인천  2787393  3282459  3468901  경상권  0.1562

columns 순서 변경

In [38]:
columns = ['지역', '2016', '2018', '2020', '증가율']
pop_df = pd.DataFrame(data, index = ['서울', '경기', '부산', '인천'],
                     columns = columns)
pop_df

     지역     2016     2018     2020     증가율
서울  수도권  8909857  9203944  9087769  0.2346
경기  경상권  5674521  4849200  7653225  0.4335
부산  수도권  6743189  5595900  6539480  0.9483
인천  경상권  3468901  3282459  2787393  0.1562

값 확인

In [40]:
pop_df.values

array([['수도권', 8909857, 9203944, 9087769, 0.2346],
       ['경상권', 5674521, 4849200, 7653225, 0.4335],
       ['수도권', 6743189, 5595900, 6539480, 0.9483],
       ['경상권', 3468901, 3282459, 2787393, 0.1562]], dtype=object)

컬럼 확인

In [41]:
pop_df.columns

Index(['지역', '2016', '2018', '2020', '증가율'], dtype='object')

인덱스 확인

In [42]:
pop_df.index

Index(['서울', '경기', '부산', '인천'], dtype='object')

index와 columns에 이름 붙이기

In [43]:
pop_df.index.name = '도시'
pop_df.columns.name = '특성'
pop_df

특성   지역     2016     2018     2020     증가율
도시
서울  수도권  8909857  9203944  9087769  0.2346
경기  경상권  5674521  4849200  7653225  0.4335
부산  수도권  6743189  5595900  6539480  0.9483
인천  경상권  3468901  3282459  2787393  0.1562

dataframe info 확인 함수

In [46]:
def dfInfo(df):
    print('df shape: {}'.format(df.shape))
    print('df size: {}'.format(df.size))
    print('df ndim: {}'.format(df.ndim))
    print('df index: {}'.format(df.index))
    print('df index type: {}'.format(type(df.index)))
    print('df columns: {}'.format(df.columns))
    print('df columns type: {}'.format(type(df.columns)))
    print('df values: \n{}'.format(df.values))

In [47]:
dfInfo(pop_df)

df shape: (4, 5)
df size: 20
df ndim: 2
df index: Index(['서울', '경기', '부산', '인천'], dtype='object', name='도시')
df index type: <class 'pandas.core.indexes.base.Index'>
df columns: Index(['지역', '2016', '2018', '2020', '증가율'], dtype='object', name='특성')
df columns type: <class 'pandas.core.indexes.base.Index'>
df values:
[['수도권' 8909857 9203944 9087769 0.2346]
 ['경상권' 5674521 4849200 7653225 0.4335]
 ['수도권' 6743189 5595900 6539480 0.9483]
 ['경상권' 3468901 3282459 2787393 0.1562]]

In [48]:
pop_df

특성   지역     2016     2018     2020     증가율
도시
서울  수도권  8909857  9203944  9087769  0.2346
경기  경상권  5674521  4849200  7653225  0.4335
부산  수도권  6743189  5595900  6539480  0.9483
인천  경상권  3468901  3282459  2787393  0.1562

컬럼 추가

In [49]:
pop_df['2018-2020 증가율'] = (pop_df['2020'] - pop_df['2018'])/pop_df['2018']
pop_df

특성   지역     2016     2018     2020     증가율  2018-2020 증가율
도시
서울  수도권  8909857  9203944  9087769  0.2346      -0.012622
경기  경상권  5674521  4849200  7653225  0.4335       0.578245
부산  수도권  6743189  5595900  6539480  0.9483       0.168620
인천  경상권  3468901  3282459  2787393  0.1562      -0.150822

컬럼 삭제

In [50]:
del pop_df['2018-2020 증가율']
pop_df

특성   지역     2016     2018     2020     증가율
도시
서울  수도권  8909857  9203944  9087769  0.2346
경기  경상권  5674521  4849200  7653225  0.4335
부산  수도권  6743189  5595900  6539480  0.9483
인천  경상권  3468901  3282459  2787393  0.1562

### 인덱싱

columns indexing

In [52]:
pop_df['지역']

도시
서울    수도권
경기    경상권
부산    수도권
인천    경상권
Name: 지역, dtype: object

In [55]:
pop_df[['지역', '증가율']]

특성   지역     증가율
도시
서울  수도권  0.2346
경기  경상권  0.4335
부산  수도권  0.9483
인천  경상권  0.1562

row indexing

In [56]:
pop_df[:'서울']

특성   지역     2016     2018     2020     증가율
도시
서울  수도권  8909857  9203944  9087769  0.2346

row indexing 할 때는 무조건 slicing 해야한다.  
배열 slicing도 가능

In [57]:
pop_df[:1]

특성   지역     2016     2018     2020     증가율
도시
서울  수도권  8909857  9203944  9087769  0.2346

In [58]:
pop_df

특성   지역     2016     2018     2020     증가율
도시
서울  수도권  8909857  9203944  9087769  0.2346
경기  경상권  5674521  4849200  7653225  0.4335
부산  수도권  6743189  5595900  6539480  0.9483
인천  경상권  3468901  3282459  2787393  0.1562

In [59]:
pop_df[:2]

특성   지역     2016     2018     2020     증가율
도시
서울  수도권  8909857  9203944  9087769  0.2346
경기  경상권  5674521  4849200  7653225  0.4335

In [60]:
pop_df[:'경기']

특성   지역     2016     2018     2020     증가율
도시
서울  수도권  8909857  9203944  9087769  0.2346
경기  경상권  5674521  4849200  7653225  0.4335

특정 행의 특정 열만 가져오기

In [62]:
# 서울의 2018 가져오기
pop_df['2018']['서울']

9203944

컬럼 먼저 가져오고 열을 가져올 수 있다

# 실습

In [63]:
score_data = {
    'kor': [80, 90, 50, 20],
    'eng': [93, 20, 97, 35],
    'math': [40, 69, 80, 91]
}
columns = ['kor', 'eng', 'math']
index = ['김지은', '황인범', '김정수', '최호진']

exec_df = pd.DataFrame(score_data, index = index, columns = columns)
exec_df

     kor  eng  math
김지은   80   93    40
황인범   90   20    69
김정수   50   97    80
최호진   20   35    91

- 모든 학생의 수학 점수를 시리즈로 출력하라
- 모든 학생의 국어와 영어 점수를 데이터 프레임으로 만들어라
- 모든 학생의 평균 점수를 새로운 열로 추가하라
- 최호진 학생의 영어 점수를 90점으로 수정하고 평균점수를 다시 계산하라
- 김지은 학생의 점수를 데이터프레임으로 만들어라
- 김정수 학생의 점수를 시리즈로 출력하라
- 황인범 학생의 국어점수와 수학점수를 100점으로 수정하고 평균점수도 다시 계산하라

In [64]:
exec_df['math']

김지은    40
황인범    69
김정수    80
최호진    91
Name: math, dtype: int64

In [65]:
exec_df[['kor', 'eng']]

     kor  eng
김지은   80   93
황인범   90   20
김정수   50   97
최호진   20   35

In [73]:
exec_df['mean'] = np.mean(exec_df[['kor', 'eng', 'math']].T)
exec_df

     kor  eng  math       mean
김지은   80   93    40  71.000000
황인범   90   20    69  59.666667
김정수   50   97    80  75.666667
최호진   20   35    91  48.666667

In [74]:
exec_df['eng']['최호진'] = 90
exec_df['mean'] = np.mean(exec_df[['kor', 'eng', 'math']].T)
exec_df

C:\Users\wnsgo\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

     kor  eng  math       mean
김지은   80   93    40  71.000000
황인범   90   20    69  59.666667
김정수   50   97    80  75.666667
최호진   20   90    91  67.000000

In [75]:
exec_df[:'김지은']

     kor  eng  math  mean
김지은   80   93    40  71.0

In [77]:
exec_df.T['김정수']

kor     50.000000
eng     97.000000
math    80.000000
mean    75.666667
Name: 김정수, dtype: float64

In [83]:
exec_df['kor']['황인범'] = 100
exec_df['math']['황인범'] = 100
exec_df['avg'] = np.mean(exec_df[['kor', 'eng', 'math']].T)
exec_df

C:\Users\wnsgo\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\wnsgo\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

     kor  eng  math       mean        avg
김지은   80   93    40  71.000000  71.000000
황인범  100   20   100  59.666667  73.333333
김정수   50   97    80  75.666667  75.666667
최호진   20   90    91  67.000000  67.000000

# 데이터 입출력

매직명령어 `%%`  
매직명령어로 csv 파일 만들기

In [84]:
%%writefile sample02.csv
col01,col02,col03
1,1,1
2,2,2
3,3,3
4,4,4

Writing sample02.csv

In [85]:
pd.read_csv('sample02.csv')

   col01  col02  col03
0      1      1      1
1      2      2      2
2      3      3      3
3      4      4      4

데이터 읽어오기

In [86]:
court_df = pd.read_csv('./data/court_code.txt', sep='\t', encoding='cp949')
court_df

            법정동코드                  법정동명 폐지여부
0      1100000000                 서울특별시   존재
1      1111000000             서울특별시 종로구   존재
2      1111010100         서울특별시 종로구 청운동   존재
3      1111010200         서울특별시 종로구 신교동   존재
4      1111010300         서울특별시 종로구 궁정동   존재
...           ...                   ...  ...
46175  5013032022  제주특별자치도 서귀포시 표선면 하천리   존재
46176  5013032023  제주특별자치도 서귀포시 표선면 성읍리   존재
46177  5013032024  제주특별자치도 서귀포시 표선면 가시리   존재
46178  5013032025  제주특별자치도 서귀포시 표선면 세화리   존재
46179  5013032026  제주특별자치도 서귀포시 표선면 토산리   존재

[46180 rows x 3 columns]

In [87]:
dfInfo(court_df)

df shape: (46180, 3)
df size: 138540
df ndim: 2
df index: RangeIndex(start=0, stop=46180, step=1)
df index type: <class 'pandas.core.indexes.range.RangeIndex'>
df columns: Index(['법정동코드', '법정동명', '폐지여부'], dtype='object')
df columns type: <class 'pandas.core.indexes.base.Index'>
df values:
[[1100000000 '서울특별시' '존재']
 [1111000000 '서울특별시 종로구' '존재']
 [1111010100 '서울특별시 종로구 청운동' '존재']
 ...
 [5013032024 '제주특별자치도 서귀포시 표선면 가시리' '존재']
 [5013032025 '제주특별자치도 서귀포시 표선면 세화리' '존재']
 [5013032026 '제주특별자치도 서귀포시 표선면 토산리' '존재']]

In [88]:
court_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46180 entries, 0 to 46179
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   법정동코드   46180 non-null  int64
 1   법정동명    46180 non-null  object
 2   폐지여부    46180 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.1+ MB

In [89]:
court_df.head()

        법정동코드           법정동명 폐지여부
0  1100000000          서울특별시   존재
1  1111000000      서울특별시 종로구   존재
2  1111010100  서울특별시 종로구 청운동   존재
3  1111010200  서울특별시 종로구 신교동   존재
4  1111010300  서울특별시 종로구 궁정동   존재

In [90]:
court_df.tail()

            법정동코드                  법정동명 폐지여부
46175  5013032022  제주특별자치도 서귀포시 표선면 하천리   존재
46176  5013032023  제주특별자치도 서귀포시 표선면 성읍리   존재
46177  5013032024  제주특별자치도 서귀포시 표선면 가시리   존재
46178  5013032025  제주특별자치도 서귀포시 표선면 세화리   존재
46179  5013032026  제주특별자치도 서귀포시 표선면 토산리   존재

### 문자열 함수 `.str`

폐지 여부가 존재인 것들만 데이터 프레임을 만들기

In [92]:
subset_df = court_df[court_df['폐지여부'] == '존재']
subset_df

            법정동코드                  법정동명 폐지여부
0      1100000000                 서울특별시   존재
1      1111000000             서울특별시 종로구   존재
2      1111010100         서울특별시 종로구 청운동   존재
3      1111010200         서울특별시 종로구 신교동   존재
4      1111010300         서울특별시 종로구 궁정동   존재
...           ...                   ...  ...
46175  5013032022  제주특별자치도 서귀포시 표선면 하천리   존재
46176  5013032023  제주특별자치도 서귀포시 표선면 성읍리   존재
46177  5013032024  제주특별자치도 서귀포시 표선면 가시리   존재
46178  5013032025  제주특별자치도 서귀포시 표선면 세화리   존재
46179  5013032026  제주특별자치도 서귀포시 표선면 토산리   존재

[20544 rows x 3 columns]

법정동명 앞 5자리까지만 추출

In [98]:
subset_df['법정동명'].str[:5].head()

0    서울특별시
1    서울특별시
2    서울특별시
3    서울특별시
4    서울특별시
Name: 법정동명, dtype: object

법정동명 마지막 한 글자만 추출

In [99]:
subset_df['법정동명'].str[-1:].head()

0    시
1    구
2    동
3    동
4    동
Name: 법정동명, dtype: object

공백으로 구분

In [100]:
subset_df['법정동명'].str.split(' ')

0                          [서울특별시]
1                     [서울특별시, 종로구]
2                [서울특별시, 종로구, 청운동]
3                [서울특별시, 종로구, 신교동]
4                [서울특별시, 종로구, 궁정동]
                   ...
46175    [제주특별자치도, 서귀포시, 표선면, 하천리]
46176    [제주특별자치도, 서귀포시, 표선면, 성읍리]
46177    [제주특별자치도, 서귀포시, 표선면, 가시리]
46178    [제주특별자치도, 서귀포시, 표선면, 세화리]
46179    [제주특별자치도, 서귀포시, 표선면, 토산리]
Name: 법정동명, Length: 20544, dtype: object

공백으로 구분한 것 데이터프레임으로 만들기

In [101]:
subset_df['법정동명'].str.split(' ', expand=True)

             0     1     2     3     4
0        서울특별시  None  None  None  None
1        서울특별시   종로구  None  None  None
2        서울특별시   종로구   청운동  None  None
3        서울특별시   종로구   신교동  None  None
4        서울특별시   종로구   궁정동  None  None
...        ...   ...   ...   ...   ...
46175  제주특별자치도  서귀포시   표선면   하천리  None
46176  제주특별자치도  서귀포시   표선면   성읍리  None
46177  제주특별자치도  서귀포시   표선면   가시리  None
46178  제주특별자치도  서귀포시   표선면   세화리  None
46179  제주특별자치도  서귀포시   표선면   토산리  None

[20544 rows x 5 columns]

'서울'로 시작하는 데이터 추출

In [103]:
subset_df[subset_df['법정동명'].str.startswith('서울')].head()

        법정동코드           법정동명 폐지여부
0  1100000000          서울특별시   존재
1  1111000000      서울특별시 종로구   존재
2  1111010100  서울특별시 종로구 청운동   존재
3  1111010200  서울특별시 종로구 신교동   존재
4  1111010300  서울특별시 종로구 궁정동   존재

법정동명 중 '동' 으로 끝나는 데이터만 필터링

In [105]:
subset_df[subset_df['법정동명'].str.endswith('동')].head()

        법정동코드           법정동명 폐지여부
2  1111010100  서울특별시 종로구 청운동   존재
3  1111010200  서울특별시 종로구 신교동   존재
4  1111010300  서울특별시 종로구 궁정동   존재
5  1111010400  서울특별시 종로구 효자동   존재
6  1111010500  서울특별시 종로구 창성동   존재

강서구를 포함하는 데이터 필터링

In [107]:
subset_df[subset_df['법정동명'].str.contains('강서구')].head()

          법정동코드           법정동명 폐지여부
737  1150000000      서울특별시 강서구   존재
740  1150010100  서울특별시 강서구 염창동   존재
741  1150010200  서울특별시 강서구 등촌동   존재
742  1150010300  서울특별시 강서구 화곡동   존재
743  1150010400  서울특별시 강서구 가양동   존재

법정동명에서 공백을 다른 문자'_'로 대체

In [108]:
subset_df['법정동명'].str.replace(' ','_')

0                       서울특별시
1                   서울특별시_종로구
2               서울특별시_종로구_청운동
3               서울특별시_종로구_신교동
4               서울특별시_종로구_궁정동
                 ...
46175    제주특별자치도_서귀포시_표선면_하천리
46176    제주특별자치도_서귀포시_표선면_성읍리
46177    제주특별자치도_서귀포시_표선면_가시리
46178    제주특별자치도_서귀포시_표선면_세화리
46179    제주특별자치도_서귀포시_표선면_토산리
Name: 법정동명, Length: 20544, dtype: object

공백 및 대소문자 처리

In [109]:
empty_df = pd.DataFrame({
    'col01': ['      abcd      ', '     FFFgh', 'abCCe   '],
    'col02': ['       fgHAij', '   fghhie ', 'ninpe    ']
})

In [110]:
empty_df

              col01          col02
0        abcd               fgHAij
1             FFFgh        fghhie
2          abCCe         ninpe

strip

In [121]:
empty_df['col01'].str.strip().iloc[0]

'abcd'

In [122]:
empty_df['col01'].str.lstrip().iloc[0]

'abcd      '

In [123]:
empty_df['col01'].str.rstrip().iloc[0]

'      abcd'

upper, lower, swapcase

In [124]:
empty_df['col01'].str.upper()

0          ABCD
1               FFFGH
2            ABCCE
Name: col01, dtype: object

In [127]:
empty_df['col01'].str.lower()

0          abcd
1               fffgh
2            abcce
Name: col01, dtype: object

In [126]:
empty_df['col01'].str.swapcase()

0          ABCD
1               fffGH
2            ABccE
Name: col01, dtype: object

# 실습 weather_2020

In [128]:
weather_df = pd.read_csv('./data/weather_20201012.csv', sep=',', encoding='cp949')
weather_df.head()

           날짜   지점  평균기온(℃)  최저기온(℃)  최고기온(℃)
0  1907-10-01  108     13.5      7.9     20.7
1  1907-10-02  108     16.2      7.9     22.0
2  1907-10-03  108     16.2     13.1     21.3
3  1907-10-04  108     16.5     11.2     22.0
4  1907-10-05  108     17.6     10.9     25.4

위 데이터에서 기온이 가장 높았던 날은 언제이고 몇 도 인지 데이터프레임으로 출력해보자

In [130]:
weather_df[weather_df['최고기온(℃)'] == np.max(weather_df['최고기온(℃)'])]

               날짜   지점  평균기온(℃)  최저기온(℃)  최고기온(℃)
40051  2018-08-01  108     33.6     27.8     39.6

In [132]:
weather_df[weather_df['최고기온(℃)'] == weather_df['최고기온(℃)'].max()]

               날짜   지점  평균기온(℃)  최저기온(℃)  최고기온(℃)
40051  2018-08-01  108     33.6     27.8     39.6

### year2020_baby_name

In [133]:
name_df = pd.read_csv('./data/year2020_baby_name.csv', sep=',', encoding='cp949')
name_df.head()

       NAME GENDER  COUNT
0  Isabella      F  22731
1    Sophia      F  20477
2      Emma      F  17179
3    Olivia      F  16860
4       Ava      F  15300

정렬 : sort_values(by= , ascending= )  
타입변환: astype(type)

In [158]:
sort_df = name_df.sort_values(by='COUNT', ascending=False).head(10)
sort_df

            NAME GENDER  COUNT
0       Isabella      F  22731
19698      Jacob      M  21875
1         Sophia      F  20477
19699      Ethan      M  17866
2           Emma      F  17179
19700    Michael      M  17133
19701     Jayden      M  17030
19702    William      M  16870
3         Olivia      F  16860
19703  Alexander      M  16634

In [164]:
rank_df = name_df.sort_values(by='COUNT', ascending=False)['COUNT'].rank(ascending=False)
rank = rank_df.astype('int64')
type(rank)
sort_df['RANK'] = rank

rank 함수 전에 컬럼명 써줘야 어떤 것에 대한 RANK인지 알 수 있다  
['COUNT'] 꼭 써줘야해~

In [165]:
sort_df

            NAME GENDER  COUNT  RANK
0       Isabella      F  22731     1
19698      Jacob      M  21875     2
1         Sophia      F  20477     3
19699      Ethan      M  17866     4
2           Emma      F  17179     5
19700    Michael      M  17133     6
19701     Jayden      M  17030     7
19702    William      M  16870     8
3         Olivia      F  16860     9
19703  Alexander      M  16634    10

gender 를 기준으로 M 데이터 프레임을 만들어라  
gender 를 기준으로 F 데이터 프레임을 만들어라

In [166]:
m_df = sort_df[sort_df['GENDER'] == 'M']
f_df = sort_df[sort_df['GENDER'] == 'F']

In [167]:
m_df

            NAME GENDER  COUNT  RANK
19698      Jacob      M  21875     2
19699      Ethan      M  17866     4
19700    Michael      M  17133     6
19701     Jayden      M  17030     7
19702    William      M  16870     8
19703  Alexander      M  16634    10

In [168]:
f_df

       NAME GENDER  COUNT  RANK
0  Isabella      F  22731     1
1    Sophia      F  20477     3
2      Emma      F  17179     5
3    Olivia      F  16860     9

merge

In [171]:
gender_df = pd.merge(m_df, f_df)
gender_df

Empty DataFrame
Columns: [NAME, GENDER, COUNT, RANK]
Index: []

In [175]:
m_df = m_df.reset_index(drop=True)
m_df

        NAME GENDER  COUNT  RANK
0      Jacob      M  21875     2
1      Ethan      M  17866     4
2    Michael      M  17133     6
3     Jayden      M  17030     7
4    William      M  16870     8
5  Alexander      M  16634    10

In [176]:
gender_df = pd.merge(m_df, f_df, left_index = True, right_index = True)
gender_df

    NAME_x GENDER_x  COUNT_x  RANK_x    NAME_y GENDER_y  COUNT_y  RANK_y
0    Jacob        M    21875       2  Isabella        F    22731       1
1    Ethan        M    17866       4    Sophia        F    20477       3
2  Michael        M    17133       6      Emma        F    17179       5
3   Jayden        M    17030       7    Olivia        F    16860       9

merge하려면 하나의 index를 drop한 후 left_index, right_index 도 같이 써줘야해  
m_df의 index를 reset했더니 f_df와 index넘버가 같아 merge가 되었다